HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_regdef.h
/** \\brief  Send Shift Register Low */
typedef struct _Ifx_PSI5_CH_SSRL_Bits
{
    unsigned int SD0:1;                     /**< \brief [0:0] SD0 (rw) */
    unsigned int SD1:1;                     /**< \brief [1:1] SD1 (rw) */
    unsigned int SD2:1;                     /**< \brief [2:2] SD2 (rw) */
    unsigned int SD3:1;                     /**< \brief [3:3] SD3 (rw) */
    unsigned int SD4:1;                     /**< \brief [4:4] SD4 (rw) */
    unsigned int SD5:1;                     /**< \brief [5:5] SD5 (rw) */
    unsigned int SD6:1;                     /**< \brief [6:6] SD6 (rw) */
    unsigned int SD7:1;                     /**< \brief [7:7] SD7 (rw) */
    unsigned int SD8:1;                     /**< \brief [8:8] SD8 (rw) */
    unsigned int SD9:1;                     /**< \brief [9:9] SD9 (rw) */
    unsigned int SD10:1;                    /**< \brief [10:10] SD10 (rw) */
    unsigned int SD11:1;                    /**< \brief [11:11] SD11 (rw) */
    unsigned int SD12:1;                    /**< \brief [12:12] SD12 (rw) */
    unsigned int SD13:1;                    /**< \brief [13:13] SD13 (rw) */
    unsigned int SD14:1;                    /**< \brief [14:14] SD14 (rw) */
    unsigned int SD15:1;                    /**< \brief [15:15] SD15 (rw) */
    unsigned int SD16:1;                    /**< \brief [16:16] SD16 (rw) */
    unsigned int SD17:1;                    /**< \brief [17:17] SD17 (rw) */
    unsigned int SD18:1;                    /**< \brief [18:18] SD18 (rw) */
    unsigned int SD19:1;                    /**< \brief [19:19] SD19 (rw) */
    unsigned int SD20:1;                    /**< \brief [20:20] SD20 (rw) */
    unsigned int SD21:1;                    /**< \brief [21:21] SD21 (rw) */
    unsigned int SD22:1;                    /**< \brief [22:22] SD22 (rw) */
    unsigned int SD23:1;                    /**< \brief [23:23] SD23 (rw) */
    unsigned int SD24:1;                    /**< \brief [24:24] SD24 (rw) */
    unsigned int SD25:1;                    /**< \brief [25:25] SD25 (rw) */
    unsigned int SD26:1;                    /**< \brief [26:26] SD26 (rw) */
    unsigned int SD27:1;                    /**< \brief [27:27] SD27 (rw) */
    unsigned int SD28:1;                    /**< \brief [28:28] SD28 (rw) */
    unsigned int SD29:1;                    /**< \brief [29:29] SD29 (rw) */
    unsigned int SD30:1;                    /**< \brief [30:30] SD30 (rw) */
    unsigned int SD31:1;                    /**< \brief [31:31] SD31 (rw) */
} Ifx_PSI5_CH_SSRL_Bits;

/** \\brief  Watch Dog Timer Register */
typedef struct _Ifx_PSI5_CH_WDT_Bits
{
    unsigned int WDLxw:16;                  /**< \brief [15:0] Watch Dog Timer Limit (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_PSI5_CH_WDT_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_PSI5_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_PSI5_CLC_Bits;

/** \\brief  CRCIOV Clear Register */
typedef struct _Ifx_PSI5_CRCICLR_Bits
{
    unsigned int CRCI0:1;                   /**< \brief [0:0] Clear CRCI Flag of Buffer 0 (w) */
    unsigned int CRCI1:1;                   /**< \brief [1:1] Clear CRCI Flag of Buffer 1 (w) */
    unsigned int CRCI2:1;                   /**< \brief [2:2] Clear CRCI Flag of Buffer 2 (w) */
    unsigned int CRCI3:1;                   /**< \brief [3:3] Clear CRCI Flag of Buffer 3 (w) */
    unsigned int CRCI4:1;                   /**< \brief [4:4] Clear CRCI Flag of Buffer 4 (w) */
    unsigned int CRCI5:1;                   /**< \brief [5:5] Clear CRCI Flag of Buffer 5 (w) */
    unsigned int CRCI6:1;                   /**< \brief [6:6] Clear CRCI Flag of Buffer 6 (w) */
    unsigned int CRCI7:1;                   /**< \brief [7:7] Clear CRCI Flag of Buffer 7 (w) */
    unsigned int CRCI8:1;                   /**< \brief [8:8] Clear CRCI Flag of Buffer 8 (w) */
    unsigned int CRCI9:1;                   /**< \brief [9:9] Clear CRCI Flag of Buffer 9 (w) */
    unsigned int CRCI10:1;                  /**< \brief [10:10] Clear CRCI Flag of Buffer 10 (w) */
    unsigned int CRCI11:1;                  /**< \brief [11:11] Clear CRCI Flag of Buffer 11 (w) */
    unsigned int CRCI12:1;                  /**< \brief [12:12] Clear CRCI Flag of Buffer 12 (w) */
    unsigned int CRCI13:1;                  /**< \brief [13:13] Clear CRCI Flag of Buffer 13 (w) */
    unsigned int CRCI14:1;                  /**< \brief [14:14] Clear CRCI Flag of Buffer 14 (w) */
    unsigned int CRCI15:1;                  /**< \brief [15:15] Clear CRCI Flag of Buffer 15 (w) */
    unsigned int CRCI16:1;                  /**< \brief [16:16] Clear CRCI Flag of Buffer 16 (w) */
    unsigned int CRCI17:1;                  /**< \brief [17:17] Clear CRCI Flag of Buffer 17 (w) */
    unsigned int CRCI18:1;                  /**< \brief [18:18] Clear CRCI Flag of Buffer 18 (w) */
    unsigned int CRCI19:1;                  /**< \brief [19:19] Clear CRCI Flag of Buffer 19 (w) */
    unsigned int CRCI20:1;                  /**< \brief [20:20] Clear CRCI Flag of Buffer 20 (w) */
    unsigned int CRCI21:1;                  /**< \brief [21:21] Clear CRCI Flag of Buffer 21 (w) */
    unsigned int CRCI22:1;                  /**< \brief [22:22] Clear CRCI Flag of Buffer 22 (w) */
    unsigned int CRCI23:1;                  /**< \brief [23:23] Clear CRCI Flag of Buffer 23 (w) */
    unsigned int CRCI24:1;                  /**< \brief [24:24] Clear CRCI Flag of Buffer 24 (w) */
    unsigned int CRCI25:1;                  /**< \brief [25:25] Clear CRCI Flag of Buffer 25 (w) */
    unsigned int CRCI26:1;                  /**< \brief [26:26] Clear CRCI Flag of Buffer 26 (w) */
    unsigned int CRCI27:1;                  /**< \brief [27:27] Clear CRCI Flag of Buffer 27 (w) */
    unsigned int CRCI28:1;                  /**< \brief [28:28] Clear CRCI Flag of Buffer 28 (w) */
    unsigned int CRCI29:1;                  /**< \brief [29:29] Clear CRCI Flag of Buffer 29 (w) */
    unsigned int CRCI30:1;                  /**< \brief [30:30] Clear CRCI Flag of Buffer 30 (w) */
    unsigned int CRCI31:1;                  /**< \brief [31:31] Clear CRCI Flag of Buffer 31 (w) */
} Ifx_PSI5_CRCICLR_Bits;

/** \\brief  CRCI Overview Register */
typedef struct _Ifx_PSI5_CRCIOV_Bits
{
    unsigned int CRCI0:1;                   /**< \brief [0:0] CRCI Flag of Buffer 0 (rh) */
    unsigned int CRCI1:1;                   /**< \brief [1:1] CRCI Flag of Buffer 1 (rh) */
    unsigned int CRCI2:1;                   /**< \brief [2:2] CRCI Flag of Buffer 2 (rh) */
    unsigned int CRCI3:1;                   /**< \brief [3:3] CRCI Flag of Buffer 3 (rh) */
    unsigned int CRCI4:1;                   /**< \brief [4:4] CRCI Flag of Buffer 4 (rh) */
    unsigned int CRCI5:1;                   /**< \brief [5:5] CRCI Flag of Buffer 5 (rh) */
    unsigned int CRCI6:1;                   /**< \brief [6:6] CRCI Flag of Buffer 6 (rh) */
    unsigned int CRCI7:1;                   /**< \brief [7:7] CRCI Flag of Buffer 7 (rh) */
    unsigned int CRCI8:1;                   /**< \brief [8:8] CRCI Flag of Buffer 8 (rh) */
    unsigned int CRCI9:1;                   /**< \brief [9:9] CRCI Flag of Buffer 9 (rh) */
    unsigned int CRCI10:1;                  /**< \brief [10:10] CRCI Flag of Buffer 10 (rh) */
    unsigned int CRCI11:1;                  /**< \brief [11:11] CRCI Flag of Buffer 11 (rh) */
    unsigned int CRCI12:1;                  /**< \brief [12:12] CRCI Flag of Buffer 12 (rh) */
    unsigned int CRCI13:1;                  /**< \brief [13:13] CRCI Flag of Buffer 13 (rh) */
    unsigned int CRCI14:1;                  /**< \brief [14:14] CRCI Flag of Buffer 14 (rh) */
    unsigned int CRCI15:1;                  /**< \brief [15:15] CRCI Flag of Buffer 15 (rh) */
    unsigned int CRCI16:1;                  /**< \brief [16:16] CRCI Flag of Buffer 16 (rh) */
    unsigned int CRCI17:1;                  /**< \brief [17:17] CRCI Flag of Buffer 17 (rh) */
    unsigned int CRCI18:1;                  /**< \brief [18:18] CRCI Flag of Buffer 18 (rh) */
    unsigned int CRCI19:1;                  /**< \brief [19:19] CRCI Flag of Buffer 19 (rh) */
    unsigned int CRCI20:1;                  /**< \brief [20:20] CRCI Flag of Buffer 20 (rh) */
    unsigned int CRCI21:1;                  /**< \brief [21:21] CRCI Flag of Buffer 21 (rh) */
    unsigned int CRCI22:1;                  /**< \brief [22:22] CRCI Flag of Buffer 22 (rh) */
    unsigned int CRCI23:1;                  /**< \brief [23:23] CRCI Flag of Buffer 23 (rh) */
    unsigned int CRCI24:1;                  /**< \brief [24:24] CRCI Flag of Buffer 24 (rh) */
    unsigned int CRCI25:1;                  /**< \brief [25:25] CRCI Flag of Buffer 25 (rh) */
    unsigned int CRCI26:1;                  /**< \brief [26:26] CRCI Flag of Buffer 26 (rh) */
    unsigned int CRCI27:1;                  /**< \brief [27:27] CRCI Flag of Buffer 27 (rh) */
    unsigned int CRCI28:1;                  /**< \brief [28:28] CRCI Flag of Buffer 28 (rh) */
    unsigned int CRCI29:1;                  /**< \brief [29:29] CRCI Flag of Buffer 29 (rh) */
    unsigned int CRCI30:1;                  /**< \brief [30:30] CRCI Flag of Buffer 30 (rh) */
    unsigned int CRCI31:1;                  /**< \brief [31:31] CRCI Flag of Buffer 31 (rh) */
} Ifx_PSI5_CRCIOV_Bits;

/** \\brief  CRCIOV Set Register */
typedef struct _Ifx_PSI5_CRCISET_Bits
{
    unsigned int CRCI0:1;                   /**< \brief [0:0] Set CRCI Flag of Buffer 0 (w) */
    unsigned int CRCI1:1;                   /**< \brief [1:1] Set CRCI Flag of Buffer 1 (w) */
    unsigned int CRCI2:1;                   /**< \brief [2:2] Set CRCI Flag of Buffer 2 (w) */
    unsigned int CRCI3:1;                   /**< \brief [3:3] Set CRCI Flag of Buffer 3 (w) */
    unsigned int CRCI4:1;                   /**< \brief [4:4] Set CRCI Flag of Buffer 4 (w) */
    unsigned int CRCI5:1;                   /**< \brief [5:5] Set CRCI Flag of Buffer 5 (w) */
    unsigned int CRCI6:1;                   /**< \brief [6:6] Set CRCI Flag of Buffer 6 (w) */
    unsigned int CRCI7:1;                   /**< \brief [7:7] Set CRCI Flag of Buffer 7 (w) */
    unsigned int CRCI8:1;                   /**< \brief [8:8] Set CRCI Flag of Buffer 8 (w) */
    unsigned int CRCI9:1;                   /**< \brief [9:9] Set CRCI Flag of Buffer 9 (w) */
    unsigned int CRCI10:1;                  /**< \brief [10:10] Set CRCI Flag of Buffer 10 (w) */
    unsigned int CRCI11:1;                  /**< \brief [11:11] Set CRCI Flag of Buffer 11 (w) */
    unsigned int CRCI12:1;                  /**< \brief [12:12] Set CRCI Flag of Buffer 12 (w) */
    unsigned int CRCI13:1;                  /**< \brief [13:13] Set CRCI Flag of Buffer 13 (w) */
    unsigned int CRCI14:1;                  /**< \brief [14:14] Set CRCI Flag of Buffer 14 (w) */
    unsigned int CRCI15:1;                  /**< \brief [15:15] Set CRCI Flag of Buffer 15 (w) */
    unsigned int CRCI16:1;                  /**< \brief [16:16] Set CRCI Flag of Buffer 16 (w) */
    unsigned int CRCI17:1;                  /**< \brief [17:17] Set CRCI Flag of Buffer 17 (w) */
    unsigned int CRCI18:1;                  /**< \brief [18:18] Set CRCI Flag of Buffer 18 (w) */
    unsigned int CRCI19:1;                  /**< \brief [19:19] Set CRCI Flag of Buffer 19 (w) */
    unsigned int CRCI20:1;                  /**< \brief [20:20] Set CRCI Flag of Buffer 20 (w) */
    unsigned int CRCI21:1;                  /**< \brief [21:21] Set CRCI Flag of Buffer 21 (w) */
    unsigned int CRCI22:1;                  /**< \brief [22:22] Set CRCI Flag of Buffer 22 (w) */
    unsigned int CRCI23:1;                  /**< \brief [23:23] Set CRCI Flag of Buffer 23 (w) */
    unsigned int CRCI24:1;                  /**< \brief [24:24] Set CRCI Flag of Buffer 24 (w) */
    unsigned int CRCI25:1;                  /**< \brief [25:25] Set CRCI Flag of Buffer 25 (w) */
    unsigned int CRCI26:1;                  /**< \brief [26:26] Set CRCI Flag of Buffer 26 (w) */
    unsigned int CRCI27:1;                  /**< \brief [27:27] Set CRCI Flag of Buffer 27 (w) */
    unsigned int CRCI28:1;                  /**< \brief [28:28] Set CRCI Flag of Buffer 28 (w) */
    unsigned int CRCI29:1;                  /**< \brief [29:29] Set CRCI Flag of Buffer 29 (w) */
    unsigned int CRCI30:1;                  /**< \brief [30:30] Set CRCI Flag of Buffer 30 (w) */
    unsigned int CRCI31:1;                  /**< \brief [31:31] Set CRCI Flag of Buffer 31 (w) */
} Ifx_PSI5_CRCISET_Bits;

