HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_regdef.h
/** \\brief  Interrupt Enable Register A */
typedef struct _Ifx_PSI5_INTENA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Enable Interrupt Request RSI (rw) */
    unsigned int RDI:1;                     /**< \brief [1:1] Enable Interrupt Request RDI (rw) */
    unsigned int RBI:1;                     /**< \brief [2:2] Enable Interrupt Request RBI (rw) */
    unsigned int TEI:1;                     /**< \brief [3:3] Enable Interrupt Request TEI (rw) */
    unsigned int NBI:1;                     /**< \brief [4:4] Enable Interrupt Request NBI (rw) */
    unsigned int MEI:1;                     /**< \brief [5:5] Enable Interrupt Request MEII (rw) */
    unsigned int CRCI:1;                    /**< \brief [6:6] Enable Interrupt Request CRCI (rw) */
    unsigned int FWI:1;                     /**< \brief [7:7] Enable Interrupt Request FWI (rw) */
    unsigned int RUI:1;                     /**< \brief [8:8] Enable Interrupt Request RUI (rw) */
    unsigned int RMI:1;                     /**< \brief [9:9] Enable Interrupt Request RMII (rw) */
    unsigned int TPI:1;                     /**< \brief [10:10] Enable Interrupt Request TPI (rw) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Enable Interrupt Request TPOI (rw) */
    unsigned int TSI:1;                     /**< \brief [12:12] Enable Interrupt Request TSI (rw) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Enable Interrupt Request TSOI (rw) */
    unsigned int TOI:1;                     /**< \brief [14:14] Enable Interrupt Request TOI (rw) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Enable Interrupt Request TOOI (rw) */
    unsigned int NFI:1;                     /**< \brief [16:16] Enable Interrupt Request NFI (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTENA_Bits;

/** \\brief  Interrupt Enable Register B */
typedef struct _Ifx_PSI5_INTENB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Enable Interrupt Request WSI0 (rw) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Enable Interrupt Request WSI1 (rw) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Enable Interrupt Request WSI2 (rw) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Enable Interrupt Request WSI3 (rw) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Enable Interrupt Request WSI4 (rw) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Enable Interrupt Request WSI5 (rw) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Enable Interrupt Request SDI0 (rw) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Enable Interrupt Request SDI1 (rw) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Enable Interrupt Request SDI2 (rw) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Enable Interrupt Request SDI3 (rw) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Enable Interrupt Request SDI4 (rw) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Enable Interrupt Request SDI5 (rw) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Enable Interrupt Request SOI0 (rw) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Enable Interrupt Request SOI1 (rw) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Enable Interrupt Request SOI2 (rw) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Enable Interrupt Request SOI3 (rw) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Enable Interrupt Request SOI4 (rw) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Enable Interrupt Request SOI5 (rw) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Enable Interrupt Request SCRI0 (rw) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Enable Interrupt Request SCRI1 (rw) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Enable Interrupt Request SCRI2 (rw) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Enable Interrupt Request SCRI3 (rw) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Enable Interrupt Request SCRI4 (rw) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Enable Interrupt Request SCRI5 (rw) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTENB_Bits;

/** \\brief  Interrupt Overview Register */
typedef struct _Ifx_PSI5_INTOV_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Interrupt Pending on any Node Pointer RSI (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Interrupt Pending on any Node Pointer RDI (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Interrupt Pending on any Node Pointer RBI (rh) */
    unsigned int TDI:1;                     /**< \brief [3:3] Interrupt Pending on any Node Pointer TDI (rh) */
    unsigned int TBI:1;                     /**< \brief [4:4] Interrupt Pending on any Node Pointer TBI (rh) */
    unsigned int ERRI:1;                    /**< \brief [5:5] Interrupt Pending on any Node Pointer ERRI (rh) */
    unsigned int SDI:1;                     /**< \brief [6:6] Interrupt Pending on any Node Pointer SDI (rh) */
    unsigned int FWI:1;                     /**< \brief [7:7] Interrupt Pending on any Node Pointer FWI (rh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTOV_Bits;

/** \\brief  Interrupt Set Register A */
typedef struct _Ifx_PSI5_INTSETA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Set Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Set Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Set Interrupt Request Flag RBI (w) */
    unsigned int TEI:1;                     /**< \brief [3:3] Set Interrupt Request Flag TEI (w) */
    unsigned int NBI:1;                     /**< \brief [4:4] Set Interrupt Request Flag NBI (w) */
    unsigned int MEI:1;                     /**< \brief [5:5] Set Interrupt Request Flag MEI (w) */
    unsigned int CRCI:1;                    /**< \brief [6:6] Set Interrupt Request Flag CRCI (w) */
    unsigned int FWI:1;                     /**< \brief [7:7] Set Interrupt Request Flag FWI (w) */
    unsigned int RUI:1;                     /**< \brief [8:8] Set Interrupt Request Flag RUI (w) */
    unsigned int RMI:1;                     /**< \brief [9:9] Set Interrupt Request Flag RMI (w) */
    unsigned int TPI:1;                     /**< \brief [10:10] Set Interrupt Request Flag TPI (w) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Set Interrupt Request Flag TPOI (w) */
    unsigned int TSI:1;                     /**< \brief [12:12] Set Interrupt Request Flag TSI (w) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Set Interrupt Request Flag TSOI (w) */
    unsigned int TOI:1;                     /**< \brief [14:14] Set Interrupt Request Flag TOI (w) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Set Interrupt Request Flag TOOI (w) */
    unsigned int NFI:1;                     /**< \brief [16:16] Set Interrupt Request Flag NFI (w) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTSETA_Bits;

/** \\brief  Interrupt Set Register B */
typedef struct _Ifx_PSI5_INTSETB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Set Interrupt Request Flag WSI0 (w) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Set Interrupt Request Flag WSI1 (w) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Set Interrupt Request Flag WSI2 (w) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Set Interrupt Request Flag WSI3 (w) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Set Interrupt Request Flag WSI4 (w) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Set Interrupt Request Flag WSI5 (w) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Set Interrupt Request Flag SDI0 (w) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Set Interrupt Request Flag SDI1 (w) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Set Interrupt Request Flag SDI2 (w) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Set Interrupt Request Flag SDI3 (w) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Set Interrupt Request Flag SDI4 (w) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Set Interrupt Request Flag SDI5 (w) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Set Interrupt Request Flag SOI0 (w) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Set Interrupt Request Flag SOI1 (w) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Set Interrupt Request Flag SOI2 (w) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Set Interrupt Request Flag SOI3 (w) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Set Interrupt Request Flag SOI4 (w) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Set Interrupt Request Flag SOI5 (w) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Set Interrupt Request Flag SCRI0 (w) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Set Interrupt Request Flag SCRI1 (w) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Set Interrupt Request Flag SCRI2 (w) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Set Interrupt Request Flag SCRI3 (w) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Set Interrupt Request Flag SCRI4 (w) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Set Interrupt Request Flag SCRI5 (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTSETB_Bits;

/** \\brief  Interrupt Status Register A */
typedef struct _Ifx_PSI5_INTSTATA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Receive Success Interrupt Request Flag (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Receive Data Interrupt Request Flag (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Receive Buffer Overflow Interrupt Request Flag (rh) */
    unsigned int TEI:1;                     /**< \brief [3:3] Time Slot Error Interrupt Request Flag (rh) */
    unsigned int NBI:1;                     /**< \brief [4:4] Number of Bits Wrong Request Flag (rh) */
    unsigned int MEI:1;                     /**< \brief [5:5] Error in Message Bits Flag (rh) */
    unsigned int CRCI:1;                    /**< \brief [6:6] CRC Error Request Flag (rh) */
    unsigned int FWI:1;                     /**< \brief [7:7] FIFO Warning Level Request Flag (rh) */
    unsigned int RUI:1;                     /**< \brief [8:8] Receive Memory Underrun Interrupt Request Flag (rh) */
    unsigned int RMI:1;                     /**< \brief [9:9] Receive Memory Overflow Flag (rh) */
    unsigned int TPI:1;                     /**< \brief [10:10] Transfer Preparation Interrupt Request Flag (rh) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Transmit Preparation Overflow Interrupt Request Flag (rh) */
    unsigned int TSI:1;                     /**< \brief [12:12] Transfer Shift Interrupt Request Flag (rh) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Transmit Shift Overflow Interrupt Request Flag (rh) */
    unsigned int TOI:1;                     /**< \brief [14:14] Transfer Output Interrupt Request Flag (rh) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Transmit Shift Overflow Interrupt Request Flag (rh) */
    unsigned int NFI:1;                     /**< \brief [16:16] No Frame Received Interrupt Flag (rh) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTSTATA_Bits;

