HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_regdef.h
/** \\brief  MEI Overview Register */
typedef struct _Ifx_PSI5_MEIOV_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] MEI Flag of Buffer 0 (rh) */
    unsigned int MEI1:1;                    /**< \brief [1:1] MEI Flag of Buffer 1 (rh) */
    unsigned int MEI2:1;                    /**< \brief [2:2] MEI Flag of Buffer 2 (rh) */
    unsigned int MEI3:1;                    /**< \brief [3:3] MEI Flag of Buffer 3 (rh) */
    unsigned int MEI4:1;                    /**< \brief [4:4] MEI Flag of Buffer 4 (rh) */
    unsigned int MEI5:1;                    /**< \brief [5:5] MEI Flag of Buffer 5 (rh) */
    unsigned int MEI6:1;                    /**< \brief [6:6] MEI Flag of Buffer 6 (rh) */
    unsigned int MEI7:1;                    /**< \brief [7:7] MEI Flag of Buffer 7 (rh) */
    unsigned int MEI8:1;                    /**< \brief [8:8] MEI Flag of Buffer 8 (rh) */
    unsigned int MEI9:1;                    /**< \brief [9:9] MEI Flag of Buffer 9 (rh) */
    unsigned int MEI10:1;                   /**< \brief [10:10] MEI Flag of Buffer 10 (rh) */
    unsigned int MEI11:1;                   /**< \brief [11:11] MEI Flag of Buffer 11 (rh) */
    unsigned int MEI12:1;                   /**< \brief [12:12] MEI Flag of Buffer 12 (rh) */
    unsigned int MEI13:1;                   /**< \brief [13:13] MEI Flag of Buffer 13 (rh) */
    unsigned int MEI14:1;                   /**< \brief [14:14] MEI Flag of Buffer 14 (rh) */
    unsigned int MEI15:1;                   /**< \brief [15:15] MEI Flag of Buffer 15 (rh) */
    unsigned int MEI16:1;                   /**< \brief [16:16] MEI Flag of Buffer 16 (rh) */
    unsigned int MEI17:1;                   /**< \brief [17:17] MEI Flag of Buffer 17 (rh) */
    unsigned int MEI18:1;                   /**< \brief [18:18] MEI Flag of Buffer 18 (rh) */
    unsigned int MEI19:1;                   /**< \brief [19:19] MEI Flag of Buffer 19 (rh) */
    unsigned int MEI20:1;                   /**< \brief [20:20] MEI Flag of Buffer 20 (rh) */
    unsigned int MEI21:1;                   /**< \brief [21:21] MEI Flag of Buffer 21 (rh) */
    unsigned int MEI22:1;                   /**< \brief [22:22] MEI Flag of Buffer 22 (rh) */
    unsigned int MEI23:1;                   /**< \brief [23:23] MEI Flag of Buffer 23 (rh) */
    unsigned int MEI24:1;                   /**< \brief [24:24] MEI Flag of Buffer 24 (rh) */
    unsigned int MEI25:1;                   /**< \brief [25:25] MEI Flag of Buffer 25 (rh) */
    unsigned int MEI26:1;                   /**< \brief [26:26] MEI Flag of Buffer 26 (rh) */
    unsigned int MEI27:1;                   /**< \brief [27:27] MEI Flag of Buffer 27 (rh) */
    unsigned int MEI28:1;                   /**< \brief [28:28] MEI Flag of Buffer 28 (rh) */
    unsigned int MEI29:1;                   /**< \brief [29:29] MEI Flag of Buffer 29 (rh) */
    unsigned int MEI30:1;                   /**< \brief [30:30] MEI Flag of Buffer 30 (rh) */
    unsigned int MEI31:1;                   /**< \brief [31:31] MEI Flag of Buffer 31 (rh) */
} Ifx_PSI5_MEIOV_Bits;

/** \\brief  MEIOV Set Register */
typedef struct _Ifx_PSI5_MEISET_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] Set MEI Flag of Buffer 0 (w) */
    unsigned int MEI1:1;                    /**< \brief [1:1] Set MEI Flag of Buffer 1 (w) */
    unsigned int MEI2:1;                    /**< \brief [2:2] Set MEI Flag of Buffer 2 (w) */
    unsigned int MEI3:1;                    /**< \brief [3:3] Set MEI Flag of Buffer 3 (w) */
    unsigned int MEI4:1;                    /**< \brief [4:4] Set MEI Flag of Buffer 4 (w) */
    unsigned int MEI5:1;                    /**< \brief [5:5] Set MEI Flag of Buffer 5 (w) */
    unsigned int MEI6:1;                    /**< \brief [6:6] Set MEI Flag of Buffer 6 (w) */
    unsigned int MEI7:1;                    /**< \brief [7:7] Set MEI Flag of Buffer 7 (w) */
    unsigned int MEI8:1;                    /**< \brief [8:8] Set MEI Flag of Buffer 8 (w) */
    unsigned int MEI9:1;                    /**< \brief [9:9] Set MEI Flag of Buffer 9 (w) */
    unsigned int MEI10:1;                   /**< \brief [10:10] Set MEI Flag of Buffer 10 (w) */
    unsigned int MEI11:1;                   /**< \brief [11:11] Set MEI Flag of Buffer 11 (w) */
    unsigned int MEI12:1;                   /**< \brief [12:12] Set MEI Flag of Buffer 12 (w) */
    unsigned int MEI13:1;                   /**< \brief [13:13] Set MEI Flag of Buffer 13 (w) */
    unsigned int MEI14:1;                   /**< \brief [14:14] Set MEI Flag of Buffer 14 (w) */
    unsigned int MEI15:1;                   /**< \brief [15:15] Set MEI Flag of Buffer 15 (w) */
    unsigned int MEI16:1;                   /**< \brief [16:16] Set MEI Flag of Buffer 16 (w) */
    unsigned int MEI17:1;                   /**< \brief [17:17] Set MEI Flag of Buffer 17 (w) */
    unsigned int MEI18:1;                   /**< \brief [18:18] Set MEI Flag of Buffer 18 (w) */
    unsigned int MEI19:1;                   /**< \brief [19:19] Set MEI Flag of Buffer 19 (w) */
    unsigned int MEI20:1;                   /**< \brief [20:20] Set MEI Flag of Buffer 20 (w) */
    unsigned int MEI21:1;                   /**< \brief [21:21] Set MEI Flag of Buffer 21 (w) */
    unsigned int MEI22:1;                   /**< \brief [22:22] Set MEI Flag of Buffer 22 (w) */
    unsigned int MEI23:1;                   /**< \brief [23:23] Set MEI Flag of Buffer 23 (w) */
    unsigned int MEI24:1;                   /**< \brief [24:24] Set MEI Flag of Buffer 24 (w) */
    unsigned int MEI25:1;                   /**< \brief [25:25] Set MEI Flag of Buffer 25 (w) */
    unsigned int MEI26:1;                   /**< \brief [26:26] Set MEI Flag of Buffer 26 (w) */
    unsigned int MEI27:1;                   /**< \brief [27:27] Set MEI Flag of Buffer 27 (w) */
    unsigned int MEI28:1;                   /**< \brief [28:28] Set MEI Flag of Buffer 28 (w) */
    unsigned int MEI29:1;                   /**< \brief [29:29] Set MEI Flag of Buffer 29 (w) */
    unsigned int MEI30:1;                   /**< \brief [30:30] Set MEI Flag of Buffer 30 (w) */
    unsigned int MEI31:1;                   /**< \brief [31:31] Set MEI Flag of Buffer 31 (w) */
} Ifx_PSI5_MEISET_Bits;

