HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_regdef.h
/** \\brief  Channel Trigger Value Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_CTV_Bits B;
} Ifx_PSI5_CH_CTV;

/** \\brief  Input and Output Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_IOCR_Bits B;
} Ifx_PSI5_CH_IOCR;

/** \\brief  Pulse Generation Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_PGC_Bits B;
} Ifx_PSI5_CH_PGC;

/** \\brief  Receiver Control Register A */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_RCRA_Bits B;
} Ifx_PSI5_CH_RCRA;

/** \\brief  Receiver Control Register B */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_RCRB_Bits B;
} Ifx_PSI5_CH_RCRB;

/** \\brief  Receiver Control Register C */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_RCRC_Bits B;
} Ifx_PSI5_CH_RCRC;

/** \\brief  Receive Data Register High */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_RDRH_Bits B;
} Ifx_PSI5_CH_RDRH;

/** \\brief  Receive Data Register Low */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_RDRL_Bits B;
} Ifx_PSI5_CH_RDRL;

/** \\brief  Receive Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_RSR_Bits B;
} Ifx_PSI5_CH_RSR;

/** \\brief  Send Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SCR_Bits B;
} Ifx_PSI5_CH_SCR;

/** \\brief  Send Data Register High */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SDRH_Bits B;
} Ifx_PSI5_CH_SDRH;

/** \\brief  Send Data Register Low */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SDRL_Bits B;
} Ifx_PSI5_CH_SDRL;

/** \\brief  Serial Data and Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SDS_Bits B;
} Ifx_PSI5_CH_SDS;

/** \\brief  SOF TS Capture Register SFTSC */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SFTSC_Bits B;
} Ifx_PSI5_CH_SFTSC;

/** \\brief  Send Output Register High */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SORH_Bits B;
} Ifx_PSI5_CH_SORH;

/** \\brief  Send Output Register Low */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SORL_Bits B;
} Ifx_PSI5_CH_SORL;

/** \\brief  SOP TS Capture Register SPTSC */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SPTSC_Bits B;
} Ifx_PSI5_CH_SPTSC;

/** \\brief  Send Shift Register High */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SSRH_Bits B;
} Ifx_PSI5_CH_SSRH;

/** \\brief  Send Shift Register Low */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_SSRL_Bits B;
} Ifx_PSI5_CH_SSRL;

/** \\brief  Watch Dog Timer Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CH_WDT_Bits B;
} Ifx_PSI5_CH_WDT;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CLC_Bits B;
} Ifx_PSI5_CLC;

/** \\brief  CRCIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CRCICLR_Bits B;
} Ifx_PSI5_CRCICLR;

/** \\brief  CRCI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CRCIOV_Bits B;
} Ifx_PSI5_CRCIOV;

/** \\brief  CRCIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_CRCISET_Bits B;
} Ifx_PSI5_CRCISET;

/** \\brief  PSI5 Fractional Divider Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_FDR_Bits B;
} Ifx_PSI5_FDR;

/** \\brief  Fractional Divider Register for Higher Bit Rate */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_FDRH_Bits B;
} Ifx_PSI5_FDRH;

