HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxPsi5_regdef.h
/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_OCS_Bits B;
} Ifx_PSI5_OCS;

/** \\brief  Receive Data FIFO */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RDF_Bits B;
} Ifx_PSI5_RDF;

/** \\brief  RDIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RDICLR_Bits B;
} Ifx_PSI5_RDICLR;

/** \\brief  RDI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RDIOV_Bits B;
} Ifx_PSI5_RDIOV;

/** \\brief  RDIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RDISET_Bits B;
} Ifx_PSI5_RDISET;

/** \\brief  Receive Data Memory High */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RDM_H_Bits B;
} Ifx_PSI5_RDM_H;

/** \\brief  Receive Data Memory Low */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RDM_L_Bits B;
} Ifx_PSI5_RDM_L;

/** \\brief  Receive FIFO Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RFC_Bits B;
} Ifx_PSI5_RFC;

/** \\brief  RMIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RMICLR_Bits B;
} Ifx_PSI5_RMICLR;

/** \\brief  RMI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RMIOV_Bits B;
} Ifx_PSI5_RMIOV;

/** \\brief  RMIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RMISET_Bits B;
} Ifx_PSI5_RMISET;

/** \\brief  RSIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RSICLR_Bits B;
} Ifx_PSI5_RSICLR;

/** \\brief  RSI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RSIOV_Bits B;
} Ifx_PSI5_RSIOV;

/** \\brief  RSIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_RSISET_Bits B;
} Ifx_PSI5_RSISET;

/** \\brief  TEIOV Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_TEICLR_Bits B;
} Ifx_PSI5_TEICLR;

/** \\brief  TEI Overview Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_TEIOV_Bits B;
} Ifx_PSI5_TEIOV;

/** \\brief  TEIOV Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_TEISET_Bits B;
} Ifx_PSI5_TEISET;

/** \\brief  Time Stamp Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_PSI5_TSR_Bits B;
} Ifx_PSI5_TSR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Protection range */
typedef volatile struct _Ifx_PSI5_CH
{
    Ifx_PSI5_CH_IOCR IOCR;                  /**< \brief 0, Input and Output Control Register  */
    Ifx_PSI5_CH_RCRA RCRA;                  /**< \brief 4, Receiver Control Register A  */
    Ifx_PSI5_CH_RCRB RCRB;                  /**< \brief 8, Receiver Control Register B  */
    Ifx_PSI5_CH_RCRC RCRC;                  /**< \brief C, Receiver Control Register C  */
    Ifx_PSI5_CH_WDT WDT[7];                 /**< \brief 10, Watch Dog Timer Register */
    Ifx_PSI5_CH_RSR RSR;                    /**< \brief 2C, Receive Status Register  */
    Ifx_PSI5_CH_SDS SDS[6];                 /**< \brief 30, Serial Data and Status Register */
    Ifx_PSI5_CH_SPTSC SPTSC;                /**< \brief 48, SOP TS Capture Register SPTSC */
    Ifx_PSI5_CH_SFTSC SFTSC;                /**< \brief 4C, SOF TS Capture Register SFTSC */
    Ifx_PSI5_CH_RDRL RDRL;                  /**< \brief 50, Receive Data Register Low  */
    Ifx_PSI5_CH_RDRH RDRH;                  /**< \brief 54, Receive Data Register High  */
    Ifx_PSI5_CH_PGC PGC;                    /**< \brief 58, Pulse Generation Control Register  */
    Ifx_PSI5_CH_CTV CTV;                    /**< \brief 5C, Channel Trigger Value Register  */
    Ifx_PSI5_CH_SCR SCR;                    /**< \brief 60, Send Control Register  */
    Ifx_PSI5_CH_SDRL SDRL;                  /**< \brief 64, Send Data Register Low  */
    Ifx_PSI5_CH_SDRH SDRH;                  /**< \brief 68, Send Data Register High  */
    Ifx_PSI5_CH_SSRL SSRL;                  /**< \brief 6C, Send Shift Register Low  */
    Ifx_PSI5_CH_SSRH SSRH;                  /**< \brief 70, Send Shift Register High  */
    Ifx_PSI5_CH_SORL SORL;                  /**< \brief 74, Send Output Register Low  */
    Ifx_PSI5_CH_SORH SORH;                  /**< \brief 78, Send Output Register High  */
    unsigned char reserved_7C[20];          /**< \brief 7C, \internal Reserved */
} Ifx_PSI5_CH;

/** \\brief  Receive data memory */
typedef volatile struct _Ifx_PSI5_RDM
{
    Ifx_PSI5_RDM_L L;                       /**< \brief 0, Receive Data Memory Low */
    Ifx_PSI5_RDM_H H;                       /**< \brief 4, Receive Data Memory High */
} Ifx_PSI5_RDM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

